run/codeValidation/timeConsistent/relaxation/fsiBody3/base/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:  3.0                                   |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    outside
    {
        type            rotatingWallVelocitySmooth;
        origin          (0 0 0);
        axis            (0 0 1);
        omega           10;
		T0				0.1;
    }

    inside
    {
        type            myMovingWallVelocity3;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
